Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services/care_in_your_community/social_work_services.html.txt.tmx
Source language: en
Languages: ga

source: Child welfare and protection services (including family support services) that were previously operated by the Health Service Executive have transferred to Tusla, which was established on 1 January 2014
ga: Táthar tar éis seirbhísí leasa agus cosanta leanaí arbh í Feidhmeannacht na Seirbhíse Sláinte a d’oibrigh iad roimhe seo (lena n-áirítear seirbhís tacaíochta teaghlaigh) a aistriú chuig Tusla a bunaíodh an 1 Eanáir 2014

source: The HSE may provide social work services for other groups or individuals
ga: Is féidir leis an FSS seirbhísí oibre sóisialaí a sholáthar freisin do ghrúpaí nó daoine aonair eile

source: Social work services are delivered by teams of social workers, working with individuals and groups experiencing social and emotional difficulties
ga: Seachadtar seirbhísí oibre sóisialaí ag foirne oibrithe sóisialacha, ag obair le daoine aonair agus le grúpaí a mbaineann deacrachtaí sóisialta agus mothúchánacha dóibh

source: The aim of social work is to help people achieve change and make decisions which will improve their quality of life
ga: Tá sé mar aidhm ag an obair shóisialta cúnamh a chur ar fáil do dhaoine athrú a bhaint amach agus cinntí a dhéanamh a rachaidh chun leasa a gcáilíochta beatha

source: It is also a function of social work to identify options and support steps to advance social policy and service delivery
ga: Tá ról freisin ag an obair shóisialta roghanna a aimsiú agus tacú le céimeanna le beartas sóisialta agus seachadadh seirbhíse a chur chun cinn

source: Most public hospitals employ social workers whose main task is to help people when they leave the hospital
ga: Tá oibrithe sóisialta fostaithe ag formhór na n-ospidéal poiblí agus é mar phríomhdhualgas orthu cúnamh a thabhairt do dhaoine nuair a fhágann siad an t-ospidéal

source: They may find suitable accommodation for them, help them to find a nursing home place or ensure that the necessary supports are in place if they return home
ga: D'fhéadfadh sé go n-aimseoidís cóiríocht oiriúnach dóibh, go gcuirfidís cúnamh ar fáil dóibh le háit i dteach altranais a aimsiú nó go gcinnteoidís go bhfuil na tacaíochtaí riachtanacha ar fáil má fhilleann siad abhaile

source: The availability of social workers varies considerably from one HSE area to another
ga: Is mór an éagsúlacht d’ingfhaighteacht oibrithe sóisialacha idir limistéar amháin de chuid na FSS dá chéile

source: Some Local Health Offices employ social workers specifically to cater for the needs of older people
ga: Tá oibrithe sóisialta fostaithe ag cuid de na hOifigí Sláinte Áitiúla le freastal ar riachtanais atá ag daoine níos sine

source: Social workers are registered by the Health and Social Care Professionals Council, CORU
ga: Is leis an gComhairle um Ghairmithe Sláinte agus Cúraim Shóisialaigh, CORU, atá Oibrithe Sóisialacha cláraithe

source: The Irish Association of Social Workers is the the national body representing social workers
ga: Is iad Cumann na hÉireann um Oibrithe Sóisialta an comhlacht náisiúnta a dhéanann ionadaíocht d’Oibrithe Sóisialta

source: For more information on social work, contact the Assocation at the address below (see 'Where to apply')
ga: Chun teacht ar thuilleadh faisnéise ar obair shóisialta, déan teagmháil leis an gCumann ag an seoladh thíos

source: You can apply directly to your Local Health Office or hospital for assistance from a social worker
ga: Féadfaidh tú iarratas a dhéanamh go díreach ar d’Oifig Áitiúil Sláinte nó ar d’ospidéal chun cúnamh a fháil ó oibrí sóisialta
